# Базовый образ - берём готовый Python 3.12 (лёгкая версия slim)
FROM python:3.12-slim

# Рабочая папка ВНУТРИ контейнера
WORKDIR /app

# Сначала копируем ТОЛЬКО requirements.txt
# (это специальный трюк для ускорения повторных сборок - Docker кэширует
# установку зависимостей отдельно от копирования всего кода)
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Теперь копируем весь остальной код проекта
COPY . .

# Команда, которая запустится, когда контейнер стартует
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0", "--reload"]